url = 'https://matrix.restautomat.ru:18448'
login = "APoluyanov"
password = "Hibraltar_1995"
room_id = "!JtYomtSYacVfwKHWig:matrix.restautomat.ru"
test_id = "!AyVcYXjBLCeejVbfHb:matrix.restautomat.ru"
agasuk = 'тут будет айдишник Гасюка'
# worker - id сотрудника, приславшего соощение
# book - книга экселя, в которой ведётся учёт
# start_time_cell - адрес ячейки в таблице, в которую записывается время начада. Столбец "Приступил к работе"
# stop_time_cell - адрес ячейки в таблице, в которую записывается время окончания. Столбец "Закончил работать"
# worker_writed_time - время, которое прислал сотрудник
# real_time - время отправки сообщения
# real_date - дата отправки. Используется для определения ячейки
# check_time - флаг соответствия написанного и реального времени
# cell_for_write - ячейка таблицы, в которую надо записать время
# cell_value_must_be - значение ячейки, которое мы ищем в таблице
# found_string - флаг поиска нужной строки


# def on_message(room, event): функция, которая запускается, когда приходит сообщение
#
# def message_decoding(message, sending_time): функция разбора сообщения. На вход получает объект "event"
# Возвращает имя/фамилию сотрудника (worker) и время, которое он указал в человеческом формате чч:мм (time_1)
# def check_time(time_1, time_2): проверяет отправленное и реальное время. Если разница больше 15 минут, пишет Гасюку
#
#
#

#
#
#
#
#
#
#